In [101]:
import pandas as pd
data=pd.read_csv("udata.txt",sep='|',header=None,names=(['User_Id','Age','Gender','Occupation','ZipCode']))

In [102]:
data.head(25)

    User_Id  Age Gender     Occupation ZipCode
0         1   24      M     technician   85711
1         2   53      F          other   94043
2         3   23      M         writer   32067
3         4   24      M     technician   43537
4         5   33      F          other   15213
5         6   42      M      executive   98101
6         7   57      M  administrator   91344
7         8   36      M  administrator   05201
8         9   29      M        student   01002
9        10   53      M         lawyer   90703
10       11   39      F          other   30329
11       12   28      F          other   06405
12       13   47      M       educator   29206
13       14   45      M      scientist   55106
14       15   49      F       educator   97301
15       16   21      M  entertainment   10309
16       17   30      M     programmer   06355
17       18   35      F          other   37212
18       19   40      M      librarian   02138
19       20   42      F      homemaker   95660
20       21   26      M         writer   30068
21       22   25      M         writer   40206
22       23   30      F         artist   48197
23       24   21      F         artist   94533
24       25   39      M       engineer   55107

In [103]:
data.tail(10)

     User_Id  Age Gender     Occupation ZipCode
933      934   61      M       engineer   22902
934      935   42      M         doctor   66221
935      936   24      M          other   32789
936      937   48      M       educator   98072
937      938   38      F     technician   55038
938      939   26      F        student   33319
939      940   32      M  administrator   02215
940      941   20      M        student   97229
941      942   48      F      librarian   78209
942      943   22      M        student   77841

In [105]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   User_Id     943 non-null    int64
 1   Age         943 non-null    int64
 2   Gender      943 non-null    object
 3   Occupation  943 non-null    object
 4   ZipCode     943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [106]:
len(data.columns)

5

In [107]:
data.columns

Index(['User_Id', 'Age', 'Gender', 'Occupation', 'ZipCode'], dtype='object')

In [108]:
data.dtypes

User_Id        int64
Age            int64
Gender        object
Occupation    object
ZipCode       object
dtype: object

In [109]:
data['Occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: Occupation, Length: 943, dtype: object

In [110]:
data['Occupation'].value_counts()[0]

196

In [111]:
data['Age'].mean()

34.05196182396607

In [114]:
data['Age'].value_counts().min()

1